[fix] diagram
